Revit 2027 API
ScheduleField.HeadingOrientation Property
 The orientation of the column heading text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleHeadingOrientation HeadingOrientation { get; set; }
Public Property HeadingOrientation As ScheduleHeadingOrientation
	Get
	Set
public:
property ScheduleHeadingOrientation HeadingOrientation {
	ScheduleHeadingOrientation get ();
	void set (ScheduleHeadingOrientation value);
}
member HeadingOrientation : ScheduleHeadingOrientation with get, set
Property Value
ScheduleHeadingOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace